In [1]:
import pandas as pd

In [5]:
data = [['harry', 34], ['jack', 35], ['jill', 40]]
data

[['harry', 34], ['jack', 35], ['jill', 40]]

In [7]:
pd.DataFrame(data, columns=["Name", "Marks"])

    Name  Marks
0  harry     34
1   jack     35
2   jill     40

In [11]:
data = {"a": [10, 20, 30], "b": [30, 40, 50]}
data

{'a': [10, 20, 30], 'b': [30, 40, 50]}

In [15]:
df = pd.DataFrame(data)
df

    a   b
0  10  30
1  20  40
2  30  50